#include <stdio.h>
int main(int argc, char const *argv[])
{
	//-------------------------数组----------------------------

	// 1、数组的定义

	int arry[5] = {1,2,3,4,5};
	// int arry[4] = {1,2,3,4,5};  错误：元素的个数不能超过数组的大小
	int arry1[5] = {2,3,4};

	int arry2[] = {2,3,4,5,7,7,8,9}; // 不指定数组的大小，由右面赋值的数据决定

	int a;
	a = 200;
	int arry3[5];
	// arry3[5] = {1,2,3,4,5}; 错误的不能这样给数组赋初始值

	int arry4[5];
	arry4[0] = 1;
	arry4[1] = 2;
	arry4[2] = 3;
	arry4[3] = 4;
	arry4[4] = 5;
	// arry4[5] = 6; 错误：不能超过数组的个数

	float f_arr[5] = {23.43,54.66,46.554,65,100};
	int i_arr[5] = {324.44,65.8,5,6,8}; // 这样写会有警告，浮点数会被强制转为整型

	int i = 5;
	// int arr_[i] = {2,3,4,5,6}; 错误：定义数组时[]只能是常量，不能使用变量

	int arr5[]; // 这样定义的数组是不会开辟内存空间的
	// arr5[0] = 10; 错误的
	
	

	return 0;
}